cmake.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-06-14 Wed 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Note of Modern CMake</title>
<meta name="author" content="scturtle" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Note of Modern CMake</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfd19b4b">1. how to run</a>
<ul>
<li><a href="#org2ed0269">1.1. 初始化</a></li>
<li><a href="#orgf1b3a02">1.2. 构建</a></li>
<li><a href="#orgb6cfd40">1.3. 指定编译器</a></li>
</ul>
</li>
<li><a href="#orgc2f9ccd">2. 语法</a>
<ul>
<li><a href="#orgb525d60">2.1. 基础</a></li>
<li><a href="#org95dec7a">2.2. 变量</a></li>
<li><a href="#org2dff734">2.3. 控制流</a></li>
<li><a href="#orgd55c41d">2.4. generator-expressions</a></li>
</ul>
</li>
<li><a href="#org0912cd1">3. 目录结构</a></li>
<li><a href="#org44e5f53">4. -fPIC</a></li>
<li><a href="#orgbd5c730">5. find package</a></li>
<li><a href="#org4469b00">6. tools</a></li>
<li><a href="#orgb01f41a">7. take away</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd19b4b" class="outline-2">
<h2 id="orgfd19b4b"><span class="section-number-2">1.</span> how to run</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2ed0269" class="outline-3">
<h3 id="org2ed0269"><span class="section-number-3">1.1.</span> 初始化</h3>
<div class="outline-text-3" id="text-1-1">
<p>
指定代码根目录和构建目录：
</p>
<div class="org-src-container">
<pre class="src src-plain">$ cmake -S . -B build
</pre>
</div>

<p>
<code>-DXXX=yyy</code> 用来 override 一些变量。
</p>

<p>
最常用的 <code>-DCMAKE_BUILD_TYPE=Relase/Debug/RelWithDebInfo/MinSizeRel</code> 开启优化，分别对应：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Release</td>
<td class="org-left">-O3 -DNDEBUG</td>
</tr>

<tr>
<td class="org-left">Debug</td>
<td class="org-left">-O0 -g</td>
</tr>

<tr>
<td class="org-left">RelWithDebInfo</td>
<td class="org-left">-O2 -g -DNDEBUG</td>
</tr>

<tr>
<td class="org-left">MinSizeRel</td>
<td class="org-left">-Os -DNDEBUG</td>
</tr>
</tbody>
</table>

<p>
<code>-DCMAKE_INSTALL_PREFIX=</code> 安装到哪里，默认为 <code>/usr/local</code> 。
</p>

<p>
<code>-DCMAKE_EXPORT_COMPILE_COMMANDS=1</code> 用来生成 <code>compile_commands.json</code> 。
</p>

<p>
<code>-GNinja</code> 使用 ninja 替代 make。
</p>
</div>
</div>

<div id="outline-container-orgf1b3a02" class="outline-3">
<h3 id="orgf1b3a02"><span class="section-number-3">1.2.</span> 构建</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-plain">$ cmake --build build
</pre>
</div>

<p>
<code>-jN</code> 并行。
</p>

<p>
<code>-v</code> 相当于 <code>VERBOSE=1 make</code> 或 <code>ninja -v</code> 。
</p>

<p>
<code>--target install</code> 或 <code>--install</code> 构建并安装到 <code>CMAKE_INSTALL_PREFIX</code> 所指向的目录下。
</p>
</div>
</div>

<div id="outline-container-orgb6cfd40" class="outline-3">
<h3 id="orgb6cfd40"><span class="section-number-3">1.3.</span> 指定编译器</h3>
<div class="outline-text-3" id="text-1-3">
<p>
一种方法是：
</p>
<div class="org-src-container">
<pre class="src src-plain">$ CC=clang CXX=clang++ cmake ..
</pre>
</div>

<p>
另一种：
</p>
<div class="org-src-container">
<pre class="src src-plain">$ cmake -DCMAKE_C_COMPILER=clang -DCMAKE_CXX_COMPILER=clang++ ..
</pre>
</div>

<p>
重新生效需要删除 <code>build/CMakeCache.txt</code> 。
</p>
</div>
</div>
</div>

<div id="outline-container-orgc2f9ccd" class="outline-2">
<h2 id="orgc2f9ccd"><span class="section-number-2">2.</span> 语法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgb525d60" class="outline-3">
<h3 id="orgb525d60"><span class="section-number-3">2.1.</span> 基础</h3>
<div class="outline-text-3" id="text-2-1">
<p>
第一行：
</p>
<div class="org-src-container">
<pre class="src src-cmake">cmake_minimum_required(VERSION 3.10 FATAL_ERROR)
</pre>
</div>

<p>
第二行：
</p>
<div class="org-src-container">
<pre class="src src-cmake">project(YourFancyProjectName LANGUAGES CXX)
</pre>
</div>

<p>
添加可执行程序的 target:
</p>
<div class="org-src-container">
<pre class="src src-cmake">add_executable(main main.cc)
</pre>
</div>

<p>
添加静态库或动态库的 target:
</p>
<div class="org-src-container">
<pre class="src src-cmake">add_library(mylib STATIC mylib.cc)
add_library(mylib SHARED mylib.cc)
</pre>
</div>

<p>
不指定则根据 <code>BUILD_SHARED_LIBS</code> 变量选择。
</p>

<p>
添加 include 目录：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_include_directories(main PUBLIC include)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">PUBLIC</td>
<td class="org-left">传播到链接此 target 的任何 target</td>
</tr>

<tr>
<td class="org-left">PRIVATE</td>
<td class="org-left">仅影响当前 target，不影响依赖项</td>
</tr>

<tr>
<td class="org-left">INTERFACE</td>
<td class="org-left">仅影响依赖项</td>
</tr>
</tbody>
</table>

<p>
对于系统库或者第三方库的头文件不报 warning：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_include_directories(main SYSTEM PRIVATE ...)
</pre>
</div>

<p>
添加链接库：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_link_libraries(main PUBLIC mylib)
</pre>
</div>

<p>
指定编译功能：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_compile_features(main PUBLIC cxx_std_11)
</pre>
</div>

<p>
编译选项：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_compile_options(main PRIVATE -Werror)
</pre>
</div>

<p>
Definitions: <code>target_compile_definitions</code>.
</p>
</div>
</div>

<div id="outline-container-org95dec7a" class="outline-3">
<h3 id="org95dec7a"><span class="section-number-3">2.2.</span> 变量</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-cmake">set(VARIABLE "value")
</pre>
</div>

<p>
Debug 的时候常用：
</p>
<div class="org-src-container">
<pre class="src src-cmake">message(STATUS "MY_VARIABLE=${MY_VARIABLE}")

include(CMakePrintHelpers)
cmake_print_variables(MY_VARIABLE)
</pre>
</div>

<p>
列表默认以 <code>;</code> 分割, <code>set(MY_LIST "one" "two")</code> 相当于 <code>"one;two"</code> 。
</p>

<p>
TODO: 字符串和列表相关函数。
</p>

<p>
定义选项常用：
</p>
<div class="org-src-container">
<pre class="src src-cmake">option(MY_OPTION "This is settable from the command line" OFF)
</pre>
</div>

<p>
使选项依赖其他选项：
</p>
<div class="org-src-container">
<pre class="src src-cmake">include(CMakeDependentOption)
cmake_dependent_option(BUILD_TESTS "Build your tests" ON "VAL1;VAL2" OFF)
</pre>
</div>

<p>
属性：
</p>
<div class="org-src-container">
<pre class="src src-cmake">set_target_properties(TargetName PROPERTIES CXX_STANDARD 11)
set_property(TARGET TargetName PROPERTY CXX_STANDARD 11)
get_property(ResultVariable TARGET TargetName PROPERTY CXX_STANDARD)
</pre>
</div>

<p>
<a href="https://cmake.org/cmake/help/latest/manual/cmake-variables.7.html">cmake variables</a>
</p>

<p>
<a href="https://cmake.org/cmake/help/latest/manual/cmake-properties.7.html">cmake properties</a>
</p>
</div>
</div>


<div id="outline-container-org2dff734" class="outline-3">
<h3 id="org2dff734"><span class="section-number-3">2.3.</span> 控制流</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-cmake">if(variable)
  ...
else()
  ...
endif()
</pre>
</div>

<div class="org-src-container">
<pre class="src src-cmake">foreach(var IN ITEMS foo bar baz) ...
foreach(var IN LISTS my_list) ...
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd55c41d" class="outline-3">
<h3 id="orgd55c41d"><span class="section-number-3">2.4.</span> <a href="https://cmake.org/cmake/help/latest/manual/cmake-generator-expressions.7.html">generator-expressions</a></h3>
<div class="outline-text-3" id="text-2-4">
<p>
当 <code>CONFIG</code> 为 <code>Debug</code> 时才添加 <code>--myflag</code>:
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_compile_options(myapp PRIVATE "$&lt;$&lt;CONFIG:Debug&gt;:--myflag&gt;")
</pre>
</div>

<p>
build 和 install 时使用不同目录：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_include_directories(myapp PUBLIC
  $&lt;BUILD_INTERFACE:${CMAKE_CURRENT_SOURCE_DIR}/include&gt;
  $&lt;INSTALL_INTERFACE:include&gt;
)
</pre>
</div>

<p>
gcc 或 clang 下使用 openmp:
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_link_libraries(myapp PUBLIC
  $&lt;$&lt;CXX_COMPILER_ID:Clang&gt;:omp&gt; gomp
)
</pre>
</div>

<p>
TODO: function, macro.
</p>
</div>
</div>
</div>

<div id="outline-container-org0912cd1" class="outline-2">
<h2 id="org0912cd1"><span class="section-number-2">3.</span> 目录结构</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-plain">- project_name
  - CMakeLists.txt
  - cmake/
    - FindSomelib.cmake
    - some_functions.cmake
  - include/
    - project_name/
      - lib.h
  - src/
    - CMakeLists.txt
    - lib.cc
  - third_parties/
    - other_lib
      - CMakeLists.txt
</pre>
</div>

<p>
使用 <code>cmake</code> 目录下的 <code>*.cmake</code>:
</p>
<div class="org-src-container">
<pre class="src src-cmake">set(CMAKE_MODULE_PATH "${PROJECT_SOURCE_DIR}/cmake" ${CMAKE_MODULE_PATH})
</pre>
</div>

<p>
子目录导入：
</p>
<div class="org-src-container">
<pre class="src src-cmake">add_subdirectory(src)
add_subdirectory(3rdparty/other_lib)
</pre>
</div>
</div>
</div>

<div id="outline-container-org44e5f53" class="outline-2">
<h2 id="org44e5f53"><span class="section-number-2">4.</span> <a href="https://murphypei.github.io/blog/2018/10/compile-fpic.html">-fPIC</a></h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-cmake">set(CMAKE_POSITION_INDEPENDENT_CODE ON)
</pre>
</div>

<p>
linux 编译动态库需要加，否则连接时会报错：
</p>
<div class="org-src-container">
<pre class="src src-plain">/usr/bin/ld: test.o: relocation R_X86_64_32 against `a local symbol' can not be used when making a shared object; recompile with -fPIC
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd5c730" class="outline-2">
<h2 id="orgbd5c730"><span class="section-number-2">5.</span> find package</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://cmake.org/cmake/help/latest/manual/cmake-modules.7.html#find-modules">cmake built-in find modules</a>
</p>

<p>
首先会从 <code>CMAKE_MODULE_PATH</code> 里寻找 <code>FindPackageName.cmake</code> 。
</p>

<p>
否则会从 <code>PackageName_DIR</code> / <code>PackageName_ROOT</code> / <code>CMAKE_PREFIX_PATH</code> 等地方寻找编译好的 <code>PackageNameConfig.cmake</code> 。
</p>

<div class="org-src-container">
<pre class="src src-cmake">SET(OpenCV_DIR /home/build/opencv)
find_package(OpenCV REQUIRED)
target_link_libraries(opencv_example PRIVATE opencv::core opencv::video opencv::imgproc)
</pre>
</div>

<p>
使用部分组件：
</p>
<div class="org-src-container">
<pre class="src src-cmake">find_package(OpenCV 3.3 REQUIRED COMPONENTS highgui features2d video)
find_package(Boost 1.50 REQUIRED COMPONENTS filesystem serialization)
</pre>
</div>

<p>
对于 components 比较多的库，有时候用非 target 的 link 比较方便：
</p>
<div class="org-src-container">
<pre class="src src-cmake">target_include_directories(myapp SYSTEM PUBLIC
  ${OpenCV_INCLUDE_DIRS} ${Boost_INCLUDE_DIRS}
)
target_link_libraries(myapp PUBLIC
  ${OpenCV_LIBRARIES} ${Boost_LIBRARIES}
)
</pre>
</div>

<p>
一些 C 的包只提供了 <code>XXX.pc</code>:
</p>
<div class="org-src-container">
<pre class="src src-cmake">find_package(PkgConfig REQUIRED)
pkg_check_modules(SDL2 REQUIRED sdl2)
target_link_libraries(my_app ${SDL2_LIBRARIES})
target_include_directories(my_app PUBLIC ${SDL2_INCLUDE_DIRS})
</pre>
</div>
</div>
</div>

<div id="outline-container-org4469b00" class="outline-2">
<h2 id="org4469b00"><span class="section-number-2">6.</span> tools</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>&lt;lang&gt;_CLANG_TIDY</li>
<li>&lt;lang&gt;_CPPLINT</li>
<li>&lt;lang&gt;_INCLUDE_WHAT_YOU_USE</li>
<li>LINK_WHAT_YOU_USE</li>
</ul>
</div>
</div>

<div id="outline-container-orgb01f41a" class="outline-2">
<h2 id="orgb01f41a"><span class="section-number-2">7.</span> take away</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>不要字符串满天飞。</li>
<li>一切都是 targets 和 properties。</li>
<li>不要使用全局函数比如 <code>include_libraries</code>, <code>link_directories</code>, <code>link_libraries</code>, <code>add_compile_options</code> 。</li>
<li>不要用 <code>CMAKE_C_FLAGS</code>, <code>CMAKE_CXX_FLAGS</code> 。</li>
<li>能用 <code>PRIVATE</code> 就不用 <code>PUBLIC</code> 。</li>
<li>尽量不要用 <code>file(GLOB SRCS *.cc)</code> 。</li>
<li>善用 <code>add_subdirectory</code> 和 <code>find_package</code> 组织目录结构。</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: scturtle</p>
<p class="date">Created: 2023-06-14 Wed 17:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>